ИСПП/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНоменклатуры</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
</mdclass:Enum>

ИСПП/src/Enums/ТипыПолитикУчетаСерий/ТипыПолитикУчетаСерий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыПолитикУчетаСерий</name>
  <enumValues>
    <name>СправочноеУказаниеСерий</name>
  </enumValues>
  <enumValues>
    <name>УправлениеОстаткамиСерий</name>
  </enumValues>
  <enumValues>
    <name>УчетСебестоимостиПоСериям</name>
  </enumValues>
  <enumValues>
    <name>НеУчитывать</name>
  </enumValues>
</mdclass:Enum>

ИСПП/src/CommonModules/НоменклатураКлиентСервер/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС
#Область ПрограммныйИнтерфейс

Функция ПолучитьДопустимыеТипыПолитикУчетаСерий(Параметры) Экспорт
	
	ДопустимыеТипыПолитик = Новый Массив;
		
	Если Не Параметры.ИспользоватьСерии Тогда
		Возврат ДопустимыеТипыПолитик;
	КонецЕсли;
	
	Если Параметры.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Товар") Тогда
		
		ДопустимыеТипыПолитик.Добавить(ПредопределенноеЗначение("Перечисление.ТипыПолитикУчетаСерий.НеУчитывать"));
		//Если Параметры.НастройкаИспользованияСерий = ПредопределенноеЗначение("Перечисление.НастройкиИспользованияСерийНоменклатуры.ЭкземплярТовара") Тогда
		//	ДопустимыеТипыПолитик.Добавить(ПредопределенноеЗначение("Перечисление.ТипыПолитикУчетаСерий.СправочноеУказаниеСерий"));
		//Иначе
			ДопустимыеТипыПолитик.Добавить(ПредопределенноеЗначение("Перечисление.ТипыПолитикУчетаСерий.СправочноеУказаниеСерий"));
			ДопустимыеТипыПолитик.Добавить(ПредопределенноеЗначение("Перечисление.ТипыПолитикУчетаСерий.УправлениеОстаткамиСерий"));
			ДопустимыеТипыПолитик.Добавить(ПредопределенноеЗначение("Перечисление.ТипыПолитикУчетаСерий.УчетСебестоимостиПоСериям"));
		//КонецЕсли;
		
	КонецЕсли;
	
	Возврат ДопустимыеТипыПолитик;
	
КонецФункции

// Идентификатор потребительской упаковки
//
Функция ВидЕдиницы_ПотребительскаяУпаковка() Экспорт
	Возврат ВРег("ПотребительскаяУпаковка");
КонецФункции

// Идентификатор минимальной единицы
//
Функция ВидЕдиницы_МинимальнаяЕдиница() Экспорт
	Возврат ВРег("МинимальнаяЕдиница");
КонецФункции

// Идентификатор основной единицы
//
Функция ВидЕдиницы_ОсновнаяЕдиница() Экспорт
	Возврат ВРег("ОсновнаяЕдиница");
КонецФункции

// Возвращает представление номенклатуры для печати.
//
// Параметры:
//  НаименованиеНоменклатуры - СправочникСсылка.Номенклатура, Строка       - представление номенклатуры.
//  Серия                    - СправочникСсылка.СерииНоменклатуры, Строка  - представление серии.
//  Партия                   - СправочникСсылка.ПартииНоменклатуры, Строка - представление партии.
//
// Возвращаемое значение:
//  Строка - представление номенклатуры для печати
//
Функция ПредставлениеНоменклатурыДляПечати(НаименованиеНоменклатуры, Серия = Неопределено, Партия = Неопределено, Описание = Неопределено) Экспорт
	
	Результат = "(";
	
	Если ЗначениеЗаполнено(Серия) Тогда
		Результат = Результат + Серия;
		Результат = СтрЗаменить(Результат, "<>", "");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Партия) Тогда
		Результат = ?(Результат = "(", Результат, Результат + "; ");
		Результат = Результат + Партия;
	КонецЕсли;
	
	Результат = Результат + ")";
	Результат = ?(Результат = "()", "", " " + Результат);
	
	Если ЗначениеЗаполнено(Описание) И ПоддержкаПроектовПереопределяемый.ВыводитьОписаниеНоменклатуры() Тогда
		Результат = Результат + Символы.ПС + СокрЛП(Описание);
	КонецЕсли;
	
	Возврат СокрЛП(НаименованиеНоменклатуры) + Результат;
	
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
